src/ExchangePlans/СОД_Узлы/СОД_Узлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="b3faf631-ce22-48a7-a3f3-91d262422d2e">
  <name>СОД_Узлы</name>
  <attributes>
    <name>Узел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколДоставкиОтправлений</name>
    <type>
      <types>EnumRef.СОД_ПротоколыДоставкиОтправлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСообщения</name>
    <type>
      <types>EnumRef.СОД_ФорматыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияИсходящихОтправлений</name>
    <type>
      <types>EnumRef.СОД_ВерсияОтправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВходящихОтправлений</name>
    <type>
      <types>EnumRef.СОД_ВерсияОтправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPБазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBБазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBURIПространстваИменСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBИмяТочкиПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_НоваяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMQPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяТочкиОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяОчередиТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяОчередиТранспортПодтверждение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяОчередиТочкаАктуальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяТочкиОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяОчередиТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяОчередиТранспортПодтверждение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяОчередиТочкаАктуальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ExchangePlan>

src/ExchangePlans/СОД_Узлы/ManagerModule.bsl
#Если Сервер Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПредставлениеHTTP(Узел) Экспорт

	Возврат "http://" + Узел.HTTPСервер + ":" + Формат(Узел.HTTPПорт, "ЧГ=0") + "/" + Узел.HTTPБазаДанных + "/hs/" + Узел.HTTPИмяСервиса + "/run";
	
КонецФункции    

Функция ПолучитьПредставлениеSOAP(Узел) Экспорт

	Возврат "http://" + Узел.WEBСервер + ":" + Формат(Узел.WEBПорт, "ЧГ=0") + "/" + Узел.WEBБазаДанных + "/ws/sed_web.1cws?wsdl";
	
КонецФункции  

Функция ПолучитьОбязательныеРеквизитыHTTP() Экспорт

	Массив = Новый Массив;
	Массив.Добавить("HTTPСервер");
	Массив.Добавить("HTTPПорт");
	Массив.Добавить("HTTPБазаДанных");
	Массив.Добавить("HTTPИмяСервиса");
	
	Возврат Массив;
	
КонецФункции 

Функция ПолучитьОбязательныеРеквизитыSOAP() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("WEBСервер");
	Массив.Добавить("WEBПорт");
	Массив.Добавить("WEBБазаДанных");
	Массив.Добавить("WEBURIПространстваИменСервиса");
	Массив.Добавить("WEBИмяСервиса");
	Массив.Добавить("WEBИмяТочкиПодключения");
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#КонецЕсли
